performance-test-reports/publish-mobile-n-load-test-report/12531729049/1/user-login/2024-12-29T02-33-06Z/user_login/run.log
-    █ setup

-      █ Given Multiple Users Can access the system

-    █ And [Auth Service] Login Endpoint is accessible

-      █ When more than 10 users are trying to login at the same time

-        ✓ test start time : 2024-12-29T02:33:06Z
-        ✓ request url : http://localhost:5500/client_login
-        ✗ response status : 200
-         ↳  98% — ✓ 349226 / ✗ 6493
-        ✓ response: isJson
-        ✓ Mock N/A
-        ✓ response error : none
-        ✗ response error : 
		status-->0
		error-->read: connection reset by peer
-         ↳  0% — ✓ 0 / ✗ 2136
-        ✗ response error : 
		status-->0
		error-->dial: i/o timeout
-         ↳  0% — ✓ 0 / ✗ 916
-        ✗ response error : 
		status-->0
		error-->request timeout
-         ↳  0% — ✓ 0 / ✗ 3441

-      █ Then the system should be able to handle the load and respond with status 200

-        ✗ expected response status to equal 200
-         ↳  98% — ✓ 349226 / ✗ 6493
-        ✓ has valid json body
-        ✓ expected user login api auth token not to be null

-      █ And verify the load test client should find the breaking point

-        ✗ expected response status to equal 200
-         ↳  98% — ✓ 349226 / ✗ 6493
-        ✓ has valid json body
-        ✓ expected user login api auth token not to be null

-    _response_errors_cnt...........: 6493    7.578086/s
-    _response_success_cnt..........: 349226  407.587369/s
-    _response_total_cnt............: 355719  415.165455/s
-    checks.........................: 99.38%  ✓ 4216684     ✗ 25972 
-    data_received..................: 123 MB  144 kB/s
-    data_sent......................: 83 MB   96 kB/s
-    dropped_iterations.............: 1606310 1874.750638/s
-    group_duration.................: avg=844.69ms min=244.84µs med=2.8ms    max=1m0s     p(90)=1.24s    p(95)=2.28s  
-    http_req_blocked...............: avg=418.77ms min=0s       med=214.45µs max=19.71s   p(90)=1.03s    p(95)=2.05s  
-    http_req_connecting............: avg=418.65ms min=0s       med=169.94µs max=19.71s   p(90)=1.03s    p(95)=2.05s  
-  ✗ http_req_duration..............: avg=1.18s    min=0s       med=226.59ms max=59.52s   p(90)=664.72ms p(95)=1.23s  
-      { expected_response:true }...: avg=484.03ms min=1.04ms   med=226.28ms max=58.8s    p(90)=599.84ms p(95)=1.01s  
-  ✗ http_req_failed................: 1.82%   ✓ 6493        ✗ 349226
-    http_req_receiving.............: avg=3.01ms   min=0s       med=105.1µs  max=297.5ms  p(90)=3.78ms   p(95)=13.57ms
-    http_req_sending...............: avg=1.99ms   min=0s       med=44.71µs  max=249.08ms p(90)=3.16ms   p(95)=8.77ms 
-    http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s     
-    http_req_waiting...............: avg=1.18s    min=0s       med=225.19ms max=59.52s   p(90)=655.17ms p(95)=1.23s  
-    http_reqs......................: 355719  415.165455/s
-    iteration_duration.............: avg=1.68s    min=3.1ms    med=233.57ms max=1m0s     p(90)=2.28s    p(95)=4.37s  
-    iterations.....................: 355719  415.165455/s
-    vus............................: 3       min=0         max=1000
-    vus_max........................: 1000    min=391       max=1000